import d from "@/components/@docs/d/d"

export default async function DocsCoop() {
    return (
        <d.main
            title="Collaboration (co-op)"
            desc="co-op สิทธิพิเศษที่มีไว้เพื่อให้ผู้เล่นช่วยเหลือกันได้ [ภาษาพูด]"
            pageForm="Community"
        >
            <d.cps></d.cps>
            <d.h1 id="คืออะไร">co-op permission คืออะไรหว่า?</d.h1>
            <d.p>co-op คือสิทธิพิเศษของผู้เล่น ใช้เมื่อคุณต้องการรับความช่วยเหลือจากใครสักคน โดยเพิ่มผู้เล่นที่อยากจะช่วยเหลือคุณเข้าไปที่รายชื่อ co-op ของเกาะส่วนตัวของคุณได้เลย ง่ายใช่ไหมหล่ะ แต่!!! ก่อนที่คุณจะใช้งานเจ้า co-op คุณจะต้องรู้วิธีการใช้งานเบื้องต้นก่อนนะ</d.p>
            
            <d.h1 id="ใช้ยังไง">แล้วเจ้า co-op ต่างจากการเชิญผู้เล่นเข้าเกาะแบบปกติยังไง</d.h1>
            <d.p>ต่างสิ เพราะการเชิญแบบปกติ ผู้เล่นที่คุณต้องการเชิญต้องไม่มีเกาะส่วนตัว แต่ co-op ผู้เล่นที่คุณต้องการเชิญ จะมีเกาะส่วนตัว หรือไม่มีก็ได้</d.p>
            <d.p>TIP: หากคุณเชิญผู้เล่นที่มีเกาะส่วนตัวอยู่แล้ว คุณจะพบกับ ERROR :: [SuperiorSkyblock] You are already indide an island.</d.p>
            
            <d.h1 id="ใช้ยังไง">แล้วเจ้า co-op ใช้งานยังไงหล่ะ</d.h1>
            <d.p>เอาหล่ะ เกริ่นนำมาเยอะแล้ว มาดูวิธีใช้ co-op กันดีกว่า</d.p>

            <d.h2 id="ทำให้เกาะส่วนตัวเป็นเกาะสาธารณะ">1. ทำให้เกาะส่วนตัวเป็นเกาะสาธารณะ</d.h2>
            <d.p>ดูวิธีที่นี่ได้เลย <d.link to="welcome-sign">เปลี่ยนเกาะส่วนตัวเป็นเกาะสาธารณะ</d.link></d.p>

            <d.h2 id="เพิ่มผู้เล่นใจดีย์เข้าไปในรายชื่อ">2. เพิ่มผู้เล่นใจดีย์เข้าไปในรายชื่อ co-op</d.h2>
            <d.p>ให้เจ้าของเกาะพิมพ์คำสั่ง</d.p>
            <d.code runIn="Minecraft Command" code={`/is coop <ชื่อผู้เล่นใจดีย์>`}/>
            <d.p>&#60;ชื่อผู้เล่นใจดีย์&#62; คือชื่อผู้เล่นที่ต้องการจะช่วยคุณ ตัวอย่าง ผู้เล่นที่ชื่อว่า gornny2005 ต้องการจะช่วยผู้เล่นที่ชื่อว่า Gornny ปลูกผัก</d.p>
            <d.p>Gornny ก็ต้องพิมพ์ /is coop gornny2005 เพื่อเพิ่ม gornny2005 เข้าไปยังรายชื่อ co-op</d.p>
            <d.p>และ ตู้ม!!! ผู้เล่นใจดีย์สามารถช่วยคุณได้แล้ว</d.p>

            <d.h2 id="ให้ผู้เล่นใจดีย์มาช่วย">3. ให้ผู้เล่นใจดีย์มาช่วย</d.h2>
            <d.p>ให้ผู้เล่นใจดีย์พิมพ์คำสั่ง</d.p>
            <d.code runIn="Minecraft Command" code={`/is visit <ชื่อเจ้าของเกาะ>`}/>
            <d.p>&#60;ชื่อเจ้าของเกาะ&#62; คือชื่อผู้เล่นที่คุณต้องการจะช่วย ตัวอย่าง ผู้เล่นที่ชื่อว่า gornny2005 ต้องการจะช่วยผู้เล่นที่ชื่อว่า Gornny ปลูกผัก</d.p>
            <d.p>gornny2005 ก็ต้องพิมพ์ /is visit Gornny เพื่อเข้าไปยังเกาะของ Gornny</d.p>

            <d.h1 id="เอาผู้เล่นใจดีย์ออกจากรายชื่อ">แล้วถ้าอยากเอาผู้เล่นใจดีย์ออกจากรายชื่อ co-op หล่ะ ทำยังไง</d.h1>
            <d.p>ให้เจ้าของเกาะพิมพ์คำสั่ง</d.p>
            <d.code runIn="Minecraft Command" code={`/is uncoop <ชื่อผู้เล่นใจดีย์>`}/>
        </d.main>
    )
}