import d from "@/components/@docs/d/d"

export default async function DocsProtection() {
    return (
        <d.main
            title="เปลี่ยนเกาะส่วนตัวเป็นเกาะสาธารณะ"
            desc="คุณสามารถเปลี่ยนเกาะส่วนตัวเป็นเกาะสาธารณะ เพื่อให้ผู้เล่นคนอื่นสามารถเข้ามาในเกาะของคุณได้ [ภาษาพูด]"
            pageForm="How-To Guides"
        >
            <d.h1 id="แล้วมันไม่อันตรายหรอ">แล้วมันไม่อันตรายหรอ &ldquo;ถ้าพี่แกเล่นเปิดให้ใครก็ได้เข้าเกาะได้ตามใจชอบอ่ะ&ldquo;</d.h1>
            <d.p>ไม่จ้า เพราะผู้เล่นที่เข้ามาในเกาะไม่มีสิทธิพิเศษใดๆ เลย ยกเว้นเดินและดู (ใช่...! ทุบบล็อกไม่ได้ด้วยจ้า)</d.p>
            <d.p>เอาหล่ะ พิมพ์เยอะแล้ว มาดูวิธีใช้กันเถอะ</d.p>

            <d.h1 id="หาจุดเกิดให้ผู้เล่นที่จะเข้ามาดู">1. หาจุดเกิดให้ผู้เล่นที่จะเข้ามาดู</d.h1>
            <d.p>ตามใจคุณเลย อยากให้ผู้เล่นเกิดตรงไหน เลือกเอาตามใจชอบได้เลยจ้า ส่วนแอดขอเลือกตรงที่มีวงกลมสีแดงแล้วกัน</d.p>
            <d.image src="/Docs/welcome-sign/1.webp" />

            <d.h1 id="หาจุดเกิดให้ผู้เล่นที่จะเข้ามาดู">2. ตั้งป้ายและพิมพ์ [welcome] ลงไปในป้าย</d.h1>
            <d.p>หลังจากที่หาจุดเกิดแล้ว มาตั้งป้ายกัน ขั้นตอนนี้สำคัญมาก คุณต้องใส่ข้อความให้ถูกต้องทุกตัวอักษร มิฉะนั้น ป้ายจะไม่ทำงาน</d.p>
            <d.p>โดยสมมุติว่านี่คือป้าย คุณต้องใส่ข้อความ [welcome] ไว้บรรทัดบนสุดของป้ายเท่านั้น และบรรทัดอื่นๆ สามารถใส่ข้อความได้ตามใจชอบ</d.p>
            <d.bold>ตัวอย่าง</d.bold>
            <d.list>[welcome]</d.list>
            <d.list>ข้อความอะไรก็ได้</d.list>
            <d.list>ข้อความอะไรก็ได้</d.list>
            <d.list>ข้อความอะไรก็ได้</d.list>
            <d.image src="/Docs/welcome-sign/2.webp" />

            <d.h1 id="เช็ก">3. เช็กป้ายดีดี</d.h1>
            <d.p>ถ้าคุณทำทุกอย่างถูกต้อง ข้อความคำว่า [welcome] จะเปลี่ยนเป็นสีเขียว ดังภาพ</d.p>
            <d.p>หากเป็นสีแดง แสดงว่าคุณมีป้ายอยู่แล้ว หากคุณตั้งป้ายซ้ำ ป้ายที่ถูกเพิ่มเข้ามาใหม่จะทำงาน และ ป้ายเก่าจะไม่ทำงาน หากไม่เข้าใจ <d.externalLink to="#">กลับไปด้านบน</d.externalLink>เพื่ออ่านใหม่</d.p>
            <d.image src="/Docs/welcome-sign/3.webp" />
            
        </d.main>
    )
}
