import d from "@/components/@docs/d/d"

export default async function DocsCommandPalette() {
    return (
        <d.main
            title="Item Guide Book"
            pageForm="Utility"
            desc="เมนูพิเศษที่รวมวิธีการหาไอเทมทุกชนิดในเซิร์ฟเวอร์เอาไว้ [ภาษาพูด]"
        >
            <d.h1 id="คืออะไร">เจ้า Item Guide Book คือไรอ่ะ</d.h1>
            <d.p>Item Guide Book คือคู่มือสุดเจ๋งที่รวมวิธีหาไอเทมทุกอย่างในเกมไว้หมดเลย ไม่ว่าจะเป็นดาบวิเศษ ชุดเกราะสุดแกร่ง หรือวัตถุดิบหายาก แค่มีอันนี้ก็เหมือนลงม็อดสมุดคราฟท์</d.p>

            <d.h1 id="อยู่ที่ไหน">แล้วเจ้า Item Guide Book อยู่ที่ไหน</d.h1>
            <d.p>โดยปกติแล้ว Item Guide Book จะถูกฝังอยู่ในส่วนต่างๆ ของเกม เช่น อยู่ภายในเมนูต่างๆ หรืออาจจะอยู่ภายใน NPC บางตัว หรืออยู่ในรูปแบบของคำสั่งที่ต้องพิมพ์ในช่องแชท หรือแม้แต่ปรากฏเป็นป้ายบอกทางในสถานที่สำคัญๆ ภายในเกม</d.p>

            <d.h1 id="มีไว้เพื่ออะไร">แล้ว Item Guide Book มีไว้เพื่ออะไรหล่ะ</d.h1>
            <d.p>ถ้าอยากได้ไอเทมครบทุกชิ้นในเกม Item Guide Book คือสิ่งที่ขาดไม่ได้เลยหล่ะ มันเหมือนแผนที่นำทางที่บอกทุกเส้นทางในการหาไอเทมทุกอย่าง (ย้ำว่า... ทุกอย่าง!)</d.p>
            
            <d.h1 id="แล้ววิธีใช้หล่ะ">แล้ววิธีใช้หล่ะ</d.h1>
            <d.p>นี่คือวิธีใช้ Command Palette ฉบับสมบูรณ์</d.p>
        </d.main>
    )
}