import d from "@/components/@docs/d/d"

export default async function DocsServerRule() {
    return (
        <d.main
            title="กฎของเซิร์ฟเวอร์"
            pageForm="Getting Started"
            desc="กฎเกณฑ์ที่รับรองว่าผู้เล่นทุกคนอยู่บนกฎเกณฑ์เดียวกัน เพื่อสร้างชุมชนที่สงบสุขและปราศจากความวุ่นวาย [ภาษาทางการ]"
        >
            <d.h1 id="หมายเหตุ">หมายเหตุ</d.h1>
            <d.p>ทีมงานของเซิร์ฟเวอร์จะไม่รับผิดชอบในการส่งคืนไอเทมที่สูญหายหรือชดเชยความเสียหายที่เกิดจากผู้เล่นคนอื่น การยืมไอเทมจากผู้เล่นคนอื่นถือเป็นความเสี่ยงของคุณ</d.p>
            <d.p>หลีกเลี่ยงการพูดคุยเกี่ยวกับบุคคลที่สามในสื่อต่างๆ ที่เกี่ยวข้องกับ We Are In Space เพื่อป้องกันปัญหาทางกฎหมาย หากเกิดข้อพิพาทระหว่างผู้เล่น ทีมงานของเซิร์ฟเวอร์จะไม่เข้ามาเกี่ยวข้อง</d.p>
            <d.p>คุณต้องรับผิดชอบต่อความปลอดภัยของบัญชี Microsoft ของคุณ อย่าเปิดเผยรายละเอียดบัญชีของคุณให้ผู้อื่นทราบ หากบัญชีของคุณได้รับความเสียหาย ทีมงานของเซิร์ฟเวอร์จะไม่รับผิดชอบ</d.p>
            <d.p>ทุกๆ การซื้อขายภายในเซิร์ฟเวอร์ หรือการแลกเปลี่ยนสิ่งของจากกิจกรรมต่างๆ ภายในเซิร์ฟเวอร์ ทีมงานของเซิร์ฟเวอร์จะไม่รับผิดชอบหากสิ่งของของคุณสูญหายจากอุบัติเหตุต่าง ๆ เช่น ถูกขโมย หรือ เผลอทำลายไอเทมโดยไม่ได้ตั้งใจ การรับประกันจะครอบคุมเฉพาะเหตุการณ์ที่เกิดขึ้นจากความผิดพลาดของระบบของเซิร์ฟเวอร์ หรือเว็บไซต์ (สำหรับการรับประกัน ไปที่ <d.link to="warranty">การรับประกัน</d.link>)</d.p>

            <d.h1 id="พฤติกรรมการสนทนาที่ไม่เหมาะสม">พฤติกรรมการสนทนาที่ไม่เหมาะสม ได้แก่</d.h1>
            <d.list>การกลั่นแกล้งและคุกคาม</d.list>
            <d.list>การสแปมข้อความ</d.list>
            <d.list>การแบ่งปันข้อมูลส่วนบุคคลของผู้อื่นโดยไม่ได้รับความยินยอม</d.list>
            <d.list>การสนทนาที่เกี่ยวข้องกับเรื่องเพศ กิจกรรมที่ผิดกฎหมาย การทำร้ายตัวเอง หรือการเมือง</d.list>
            <d.list>การโฆษณาเซิฟเวอร์อื่น ๆ</d.list>
            <d.list>การใช้คำหยาบคาย</d.list>
            <d.list>การแบ่งฝ่ายเพื่อต่อสู้กันทั้งในเกม และ โลกจริง</d.list>

            <d.h1 id="พฤติกรรมการเล่นเกมที่ไม่เหมาะสม">พฤติกรรมการเล่นเกมที่ไม่เหมาะสม ได้แก่</d.h1>
            <d.list>การยั่วยุผู้เล่นคนอื่น ๆ ในทุกรูปแบบ</d.list>
            <d.list>การหลอกลวงผู้เล่นอื่น ๆ</d.list>
            <d.list>การสร้างสิ่งก่อสร้างที่ไม่เหมาะสม</d.list>
            <d.list>การใช้ชื่อผู้ใช้ และ สกินที่ไม่เหมาะสม</d.list>
            <d.list>การนินทาว่าร้ายผู้อื่นในแชทส่วนตัว</d.list>
            <d.list>การใช้ประโยชน์จากจุดบกพร่องและข้อผิดพลาด</d.list>
            <d.list>การแอบอ้างว่าเป็นทีมงานของเซิร์ฟเวอร์</d.list>
            <d.list>การทำลายสิ่งก่อสร้างของผู้อื่นที่ไม่ได้ป้องกันไว้โดยไม่ได้รับอนุญาติ (สำหรับการป้องกันสิ่งก่อสร้าง ไปที่ <d.link to="protection">การป้องกันสิ่งก่อสร้าง</d.link>)</d.list>
        </d.main>
    )
}