import d from "@/components/@docs/d/d"

export default async function DocsServerRule() {
    return (
        <d.main
            title="กฎของเซิร์ฟเวอร์"
            pageForm="Getting Started"
            desc="กฎเกณฑ์ที่รับรองว่าผู้เล่นทุกคนอยู่บนกฎเกณฑ์เดียวกัน เพื่อสร้างชุมชนที่สงบสุขและปราศจากความวุ่นวาย"
        >
            <d.h1 id="หมายเหตุ">หมายเหตุ</d.h1>
            <d.p>ทีมงานของเซิร์ฟเวอร์จะไม่รับผิดชอบในการส่งคืนไอเทมที่สูญหายหรือชดเชยความเสียหายที่เกิดจากผู้เล่นคนอื่น การยืมไอเทมจากผู้เล่นคนอื่นถือเป็นความเสี่ยงของคุณเอง</d.p>
            <d.p>หลีกเลี่ยงการพูดคุยเกี่ยวกับบุคคลที่สามในสื่อต่างๆ ที่เกี่ยวข้องกับ We Are In Space เพื่อป้องกันปัญหาทางกฎหมาย หากเกิดข้อพิพาทระหว่างผู้เล่น ทีมงานของเซิร์ฟเวอร์จะไม่เข้ามาเกี่ยวข้อง</d.p>
            <d.p>คุณต้องรับผิดชอบต่อความปลอดภัยของบัญชี Microsoft ของคุณ อย่าเปิดเผยรายละเอียดบัญชีของคุณให้ใครทราบ หากบัญชีของคุณได้รับความเสียหาย ทีมงานของเซิร์ฟเวอร์จะไม่รับผิดชอบ</d.p>
            <d.p>ทุก ๆ การซื้อของภายในเซิร์ฟเวอร์ หรือ การแลกสิ่งของต่าง ๆ จากกิจกรรมต่าง ๆ ภายในเซิร์ฟเวอร์ ทีมงานของเซิร์ฟเวอร์จะไม่รับผิดชอบหากสิ่งของของคุณศูนย์หายจากอุบัติเหตุต่าง ๆ เช่น ถูกขโมย เผลทำลายไอเทมโดยไม่ได้ตั้งใจ การรับประกันจะครอบคุมเฉพาะ เหตุการณ์ที่เกิดขึ้นจากความผิดพลาดของระบบของเซิร์ฟเวอร์ หรือ เว็บไซต์</d.p>

            <d.h1 id="พฤติกรรมการสนทนาที่ไม่เหมาะสม">พฤติกรรมการสนทนาที่ไม่เหมาะสม ได้แก่</d.h1>
            <d.list>การกลั่นแกล้งและคุกคาม</d.list>
            <d.list>การสแปมข้อความ</d.list>
            <d.list>การแบ่งปันข้อมูลส่วนบุคคลของผู้อื่นโดยไม่ได้รับความยินยอม</d.list>
            <d.list>การสนทนาที่เกี่ยวข้องกับเรื่องเพศ กิจกรรมที่ผิดกฎหมาย การทำร้ายตัวเอง หรือการเมือง</d.list>
            <d.list>การโฆษณาเซิฟเวอร์อื่น ๆ</d.list>
            <d.list>การใช้คำหยาบคาย</d.list>
            <d.list>การแบ่งฝ่ายเพื่อต่อสู้กันทั้งในเกม และ โลกจริง</d.list>

            <d.h1 id="พฤติกรรมการเล่นเกมที่ไม่เหมาะสม">พฤติกรรมการเล่นเกมที่ไม่เหมาะสม ได้แก่</d.h1>
            <d.list>การยั่วยุผู้เล่นคนอื่น ๆ ในทุกรูปแบบ</d.list>
            <d.list>การหลอกลวงผู้เล่นอื่น ๆ</d.list>
            <d.list>การสร้างสิ่งก่อสร้างที่ไม่เหมาะสมในพื้นที่ของคุณ</d.list>
            <d.list>การชื่อผู้ใช้และสกินที่น่ารังเกียจ</d.list>
            <d.list>การนินทาว่าร้ายผู้อื่นในแชทส่วนตัว</d.list>
            <d.list>การใช้ประโยชน์จากจุดบกพร่องและข้อผิดพลาด</d.list>
            <d.list>การแอบอ้างว่าเป็นทีมงานของเซิร์ฟเวอร์โดยมิชอบ</d.list>
            <d.list>การทำลายสิ่งก่อสร้างของผู้อื่นที่ไม่ได้ถูกป้องกันไว้ (สำหรับการป้องกันสิ่งก่อสร้าง ไปที่ <d.link to="protection">การป้องกันสิ่งก่อสร้าง</d.link>)</d.list>
        </d.main>
    )
}